changes to appendix
